//=============================================================================
//
// 背景処理 [bg.h]
// Author : GP_11B_341_19 千葉　大樹
//
//=============================================================================
#ifndef _BG_H_
#define _BG_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_GAME_BG00		_T("data/TEXTURE/background_3.jpg")	// サンプル用画像
#define BG00_SIZE_X			(800)	// テクスチャサイズ
#define BG00_SIZE_Y			(600)	// 同上
#define BG00_POS_X			(0)		// ポリゴンの初期位置X(左上)
#define BG00_POS_Y			(0)		// 同上

#define TEXTURE_GAME_BG01		_T("data/TEXTURE/background_3.jpg")	// サンプル用画像
#define BG01_SIZE_X			(800)	// テクスチャサイズ
#define BG01_SIZE_Y			(600)	// 同上
#define BG01_POS_X			(0)		// ポリゴンの初期位置X(左上)
#define BG01_POS_Y			(0)		// 同上


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBG(int type);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

#endif
